import math
import random

def inp():
    while True:
        try:
            n = int(input("Input 'n':\nn:\t"))
        except Exception:
            print("Eror input. Try again.")
            continue
        else:
            break
    return n


def razlog():
    print("ρ-метод Полларда.")
    n = inp()
    c=random.randint(1,1000)
    a=c
    b=c
    d=1
    p=0
    while d==1:
        a=(pow(a,2)+1)%n
        b=(((b**2+1)%n)**2+1)%n
        d=math.gcd(a-b,n)
        if 1<d<n:
            p=d
            print(f"Нетривиальный делитель: {p}.")
        elif d==n:
            print("Делитель не найден")


def razlogenie_2():
    print("(ρ-1)-метод Полларда.")
    n = inp()
    base =[2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61]
    a = random.randint(2,n-2)
    print(a)
    #input()
    d = math.gcd(a,n)
    if d>=2:
        p=d
        print(f"Нетривиальный делитель: {p}.")
        return p
    else:
        for i in base:
            #log.append(math.log(n, ) // math.log(i, ))
            l = int(math.log(n, ) // math.log(i, ))
            pp = int(i**l)
            a = a**pp % n
        d = math.gcd(int(a-1),int(n))
        if d == 1 or d == n:
            print("Делитель не найден.")
            #break
        else:
            p = d
            print(f"Нетривиальный делитель: {p}.")
            #break



razlog()
razlogenie_2()


"""
baze = [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 101, 103, 107, 109, 113, 127, 131
, 137, 139, 149, 151, 157, 163, 167, 173, 179, 181, 191, 193, 197, 199, 211, 223, 227, 229, 233, 239, 241, 251, 257, 263, 269, 271, 277, 281, 283, 293, 307, 311, 313, 317, 331, 337, 347,
349, 353, 359, 367, 373, 379, 383, 389, 397, 401, 409, 419, 421, 431, 433, 439, 443, 449, 457, 461, 463, 467, 479, 487, 491, 499, 503, 509, 521, 523, 541, 547, 557, 563, 569, 571, 577, 587, 593, 599, 601, 607, 613, 617, 619, 631, 641, 643, 647, 653, 659, 661, 673, 677, 683, 691, 701, 709, 719, 727, 733, 739, 743, 751, 757, 761, 769, 773, 787, 797, 809, 811, 821, 823, 827,
 829, 839, 853, 857, 859, 863, 877, 881, 883, 887, 907, 911, 919, 929, 937, 941, 947, 953, 967, 971, 977, 983, 991, 997]

print(baze)
"""